<a href="https://colab.research.google.com/github/cinngyang/Python/blob/master/SampleCode/Pandas_GroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

+ [Simple demo of Pandas](https://www.somebits.com/~nelson/pandas-multiindex-slice-demo.html)<br>
+ get_group()
+ dt.group['data1','data2'].agg(['mean','sum'])
+ dt2.index.names / type(dt2.index)
+ dt2.index.get_level_values(0)
+ dt2.index.set_names(["col1","col2"],inplace=True)
+ dt2.set_index("col" , inplace=True)
+

In [0]:
import pandas as pd
import numpy as np

In [0]:
dt=pd.DataFrame({'BIN':['AAABB001','AAABB011','BBBCC001','BBBCC012','BBBCC031'],'QTY':[100,200,300,100,200]})
dt['CIE']=dt['BIN'].str[0:5]
dt['IV']=dt['BIN'].str[5:7]
dt['VF']=dt['BIN'].str[7:8]
dt=dt[['BIN','CIE','IV','VF','QTY']]
dt

        BIN    CIE  IV VF  QTY
0  AAABB001  AAABB  00  1  100
1  AAABB011  AAABB  01  1  200
2  BBBCC001  BBBCC  00  1  300
3  BBBCC012  BBBCC  01  2  100
4  BBBCC031  BBBCC  03  1  200

In [0]:
G1=dt['QTY'].groupby([dt['CIE'],dt['IV']])
G1

In [0]:
dt2=dt.groupby([dt['CIE'],dt['IV'],dt['VF']])[['QTY']].sum()
dt2

             QTY
CIE   IV VF
AAABB 00 1   100
      01 1   200
BBBCC 00 1   300
      01 2   100
      03 1   200

In [0]:
dt.groupby([dt['CIE'],dt['IV'],dt['VF']])[['QTY']].size()

CIE    IV  VF
AAABB  00  1     1
       01  1     1
BBBCC  00  1     1
       01  2     1
       03  1     1
dtype: int64

In [0]:
dt2.index.names
type(dt2.index)

pandas.core.indexes.multi.MultiIndex

In [0]:
print(dt2.index.get_level_values(0))
print(dt2.index.get_level_values(1))

Index(['AAABB', 'AAABB', 'BBBCC', 'BBBCC', 'BBBCC'], dtype='object', name='CIE')
Index(['00', '01', '00', '01', '03'], dtype='object', name='IV')

In [0]:
df = pd.DataFrame({'A' : list('wwwwxxxx'), 
                   'B':list('yyzzyyzz'), 
                   'C':np.random.rand(8), 
                   'D':np.random.rand(8)})

In [5]:
df

   A  B         C         D
0  w  y  0.019031  0.503879
1  w  y  0.178068  0.932910
2  w  z  0.512452  0.185177
3  w  z  0.479785  0.765480
4  x  y  0.980736  0.236647
5  x  y  0.907515  0.570620
6  x  z  0.797565  0.028970
7  x  z  0.940594  0.141098

In [4]:
df.groupby(['A', 'B']).agg({'C':['mean', 'median'], 'D':'max'})

            C                   D
         mean    median       max
A B
w y  0.098550  0.098550  0.932910
  z  0.496118  0.496118  0.765480
x y  0.944125  0.944125  0.570620
  z  0.869080  0.869080  0.141098

In [6]:
df.groupby(['A', 'B']).agg({'C':{'C_mean': 'mean', 'C_median': 'median'}, 
                            'D':{'D_max': 'max'}})

/usr/local/lib/python3.6/dist-packages/pandas/core/groupby.py:4291: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

            C                   D
       C_mean  C_median     D_max
A B
w y  0.098550  0.098550  0.932910
  z  0.496118  0.496118  0.765480
x y  0.944125  0.944125  0.570620
  z  0.869080  0.869080  0.141098

In [0]:
df = pd.DataFrame({"User": ["user1", "user2", "user2", "user3", "user2", "user1", "user3"],
                  "Amount": [10.0, 5.0, 8.0, 10.5, 7.5, 8.0, 9],
                  'Score': [9, 1, 8, 7, 7, 6, 9]})

In [8]:
df

   Amount  Score   User
0    10.0      9  user1
1     5.0      1  user2
2     8.0      8  user2
3    10.5      7  user3
4     7.5      7  user2
5     8.0      6  user1
6     9.0      9  user3

In [0]:
def my_agg(x):
    names = {
        'Amount mean': x['Amount'].mean(),
        'Amount std':  x['Amount'].std(),
        'Amount range': x['Amount'].max() - x['Amount'].min(),
        'Score Max':  x['Score'].max(),
        'Score Sum': x['Score'].sum(),
        'Amount Score Sum': (x['Amount'] * x['Score']).sum()}

    return pd.Series(names, index=['Amount range', 'Amount std', 'Amount mean',
                                   'Score Sum', 'Score Max', 'Amount Score Sum'])

In [10]:
df.groupby('User').apply(my_agg)

,Amount range,Amount std,Amount mean,Score Sum,Score Max,Amount Score Sum
User,,,,,,
user1,2.0,1.414214,9.000000,15.0,9.0,138.0
user2,3.0,1.607275,6.833333,16.0,8.0,121.5
user3,1.5,1.060660,9.750000,16.0,9.0,154.5